Repository: ruifontes/tesseractOCR
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, fi, ru

source: Page is rotated to the right. Do you want to process the OCR?
fi: Sivu on käännetty oikealle. Haluatko suorittaa tekstintunnistuksen?
ru: Страница повёрнута вправо. Вы хотите выполнить распознавание текста?

source: Page is upside down. Do you want to process the OCR?
fi: Sivu on ylösalaisin. Haluatko suorittaa tekstintunnistuksen?
ru: Страница перевёрнута. Вы хотите выполнить распознавание текста?

source: Page is rotated to the left. Do you want to process the OCR?
fi: Sivu on käännetty vasemmalle. Haluatko suorittaa tekstintunnistuksen?
ru: Страница повёрнута влево. Вы хотите выполнить распознавание текста?

source: Page is positioned correctly. Do you want to process the OCR?
fi: Sivu on oikein päin. Haluatko suorittaa tekstintunnistuksen?
ru: Страница расположена правильно. Вы хотите выполнить распознавание текста?

source: It is not a true PDF file!
es: ¡No es un verdadero archivo PDF!
fi: Tämä ei ole aito PDF-tiedosto!
ru: Это не настоящий PDF-файл!

source: The PDF is password protected. If you have introduced the password, make sure it is the correct one. Otherwise, please go to NVDA configurations, TesseractOCR options and mark the checkbox 'Ask for password'
es: El PDF está protegido con contraseña. Si ha introducido la contraseña, asegúrese de que sea la correcta. De lo contrario, vaya a las Preferencias de NVDA, Opciones, TesseractOCR y marque la casilla de verificación "Solicitar contraseña"
fi: PDF on suojattu salasanalla. Mikäli olet antanut salasanan, varmista, että se on oikein. Siirry muussa tapauksessa NVDA:n asetusvalintaikkunaan, siellä TesseractOCR-kategoriaan ja valitse "Pyydä salasanaa" -valintaruutu.
ru: PDF-файл защищён паролем. Если вы ввели пароль, убедитесь, что он правильный. В противном случае, пожалуйста, перейдите в настройки NVDA, параметры TesseractOCR и установите флажок "Запрашивать пароль"PDF-файл защищён паролем. Если вы ввели пароль, убедитесь, что он правильный. В противном случае, пожалуйста, перейдите в настройки NVDA, параметры TesseractOCR и установите флажок "Запрашивать пароль"

source: Performs OCR to focused file in File Explorer
es: Realiza el reconocimiento de texto del archivo seleccionado en el Explorador de archivos
fi: Suorittaa tekstintunnistuksen valitulle tiedostolle resurssienhallinnassa
ru: Выполняет распознавание текста файла в фокусе в проводнике

source: You are not in File Explorer to perform OCR on a image file...
fi: Et ole resurssienhallinnassa kuvatiedoston kohdalla.
ru: Вы не находитесь в проводнике, чтобы выполнить распознавание изображения...

source: Processing... Please wait... This operation can takes some seconds...
es: Procesando... Espera por Favor... Esta operación puede tomar algunos segundos...
fi: Käsitellään, odota... Tämä voi kestää joitakin sekunteja.
ru: Обработка... Пожалуйста, подождите... Эта операция может занять несколько секунд...

source: File not supported
es: Archivo no admitido
fi: Tiedostoa ei tueta
ru: Файл не поддерживается

source: Performs OCR to a document on the scanner
es: Realiza el reconocimiento de texto del documento en el escáner
fi: Suorittaa tekstintunnistuksen skannerissa olevalle asiakirjalle
ru: Выполняет распознавание текста документа на сканере

source: Gets the text from focused accessible PDF file in File Explorer
fi: Hakee tekstin valitusta saavutettavasta PDF-tiedostosta resurssienhallinnassa
ru: Извлекает текст из доступного PDF-файла в проводнике

source: Cancel scanning
fi: Peruuta skannaus
ru: Отменяет сканирование

source: Scanning process terminated!
fi: Skannaus keskeytetty!
ru: Сканирование завершено!

source: Enter your password
es: Ingresa tu contraseña
fi: Kirjoita salasana
ru: Введите свой пароль

source: Available recognition &language
es: &Idioma de reconocimiento disponible
fi: Käytettävissä olevat tunnistus&kielet
ru: &Язык распознавания

source: &Add
es: &Añadir
fi: &Lisää
ru: &Добавить

source: Selected languages
es: Idiomas seleccionados
fi: Valitut kielet
ru: Выбранные языки

source: &Remove
es: &Eliminar
fi: &Poista
ru: &Удалить

source: Move &up
es: Mover hacia arr&iba
fi: Siirrä &ylös
ru: Переместить &выше

source: &Move down
fi: Siirrä &alas
ru: Переместить &ниже

source: &Type of document
es: &Tipo de documento
fi: As&iakirjan tyyppi
ru: &Тип документа

source: Resolution in &DPI
fi: Skannerin tar&kkuus (pistettä tuumalla)
ru: Разрешение (&точек на дюйм)

source: Detect paper orientation
fi: Tunnista paperin asento
ru: Определять ориентацию страниц

source: Enable beeps
fi: Ota äänimerkit käyttöön
ru: Включить звуковые сигналы

source: Ask for password
es: Solicitar contraseña
fi: Pyydä salasanaa
ru: Запрашивать пароль

source: Text
es: Libros y cartas
fi: Teksti
ru: Текст

source: Various
es: Diversos
fi: Useita
ru: Разные

source: Cebuan
es: Cebuano
fi: Cebuano
ru: Кебуано

source: Cherokee
ru: Чероки

source: Esperanto
ru: Эсперанто

source: Math equations
es: Ecuaciones matemáticas
fi: Matemaattiset yhtälöt
ru: Математические формулы и выражения

source: Filipino
ru: Филиппинский

source: Scottish Gaelic
fi: skottilainen gaeli
ru: Шотландский гэльский

source: Haitian
es: Haitiano
fi: Haitilainen kreoli
ru: Гаитянский

source: Javanese
es: Javanés
fi: Jjaava
ru: Яванский

source: Latin
fi: latina
ru: Латинский

source: Punjabi
ru: Панджаби

source: Quechua
fi: ketšua
ru: Кечуа

source: Sindhi
ru: Синдхи

source: Sundanese
es: Sondanés
fi: Sunda
ru: Сунданский

source: Syriac
es: Siríaco
fi: Syyria
ru: Сирийский

source: Tigrinya
fi: tigrinja
ru: Тигри́нья

source: Tonga
es: Tongano
ru: Тонганский

source: Uyghur
fi: uiguuri
ru: Уйгурский

source: Yiddish
fi: jiddiš
ru: Идиш

source: interrupted
es: interrumpido
fi: keskeytetty
ru: прервано

source: No scanner found. Please check the device connection.
fi: Skanneria ei löydy. Tarkista, että laite on kytketty oikein.
ru: Сканер не найден. Пожалуйста, проверьте подключение устройства.

source: Select the scanner to use:
fi: Valitse käytettävä skanneri:
ru: Выберите сканер:

source: Available Scanners
fi: Käytettävissä olevat skannerit
ru: Доступные сканеры

source: Do you want to scan one more page?
es: ¿Quieres escanear una página más?
fi: Haluatko skannata lisää sivuja?
ru: Вы хотите отсканировать ещё одну страницу?

source: Error during scanning: {}
fi: Virhe skannattaessa: {}
ru: Ошибка во время сканирования: {}

source: Scanner not found.
fi: Skanneria ei löydy.
ru: Сканер не найден.

source: No scanner was selected or found.
fi: Skanneria ei ole valittu tai sitä ei löydy.
ru: Сканер не выбран или не найден.

source: With auto-orientation
es: Con auto-orientación
fi: Automaattinen asento
ru: С автоматической ориентацией

source: TesseractOCR: An OCR add-on
es: TesseractOCR: un complemento de OCR
fi: TesseractOCR: Tekstintunnistuslisäosa
ru: TesseractOCR: Дополнение для распознавания текста

source: Performs OCR on the selected image file, PDF, JPG, TIF, etc, or a document through a scanner and also can get the text from an accessible PDF file. The results are shown in a text file. Windows+Control+r - Performs OCR to the selected image file Windows+Control+w - Scans and recognize the document in the scanner Windows+Control+t - To get the text from an accessible PDF
fi: Suorittaa tekstintunnistuksen valitulle kuvatiedostolle (PDF, JPG, TIF, jne.), skannerissa olevalle asiakirjalle tai hakee tekstin saavutettavasta PDF-tiedostosta. Tulokset näytetään tekstitiedostossa. Windows+Ctrl+R: Suorittaa tekstintunnistuksen valitulle kuvatiedostolle Windows+Ctrl+W: Skannaa skannerissa olevan asiakirjan ja suorittaa sille tekstintunnistuksen Windows+Ctrl+T: Hakee tekstin saavutettavasta PDF-tiedostosta
ru: Выполняет распознавание выбранного файла изображения, PDF, JPG, TIF и т.д., или документа с помощью сканера, а также может извлечь текст из доступного PDF-файла. Результаты отображаются в текстовом файле, ocr.txt. Windows+Control+r - Выполняет распознавание текста для выбранного файла изображения Windows+Control+w - Сканирует и распознаёт документ в сканере Windows+Control+t - извлекает текст из доступного PDF-файла.

source: Rui Fontes <rui.fontes@tiflotecnia.com>, Ângelo Abrantes <ampa4374@gmail.com> and Abel Passos do Nascimento Jr. <abel.passos@gmail.com>
es: Rui Fontes <rui.fontes@tiflotecnia.com>, Ângelo Abrantes <ampa4374@gmail.com> y Abel Passos do Nascimento Jr. <abel.passos@gmail.com>
fi: Rui Fontes <rui.fontes@tiflotecnia.com>, Ângelo Abrantes <ampa4374@gmail.com> ja Abel Passos do Nascimento nuorempi <abel.passos@gmail.com>
ru: Rui Fontes <rui.fontes@tiflotecnia.com>, Ângelo Abrantes <ampa4374@gmail.com> и Abel Passos do Nascimento Jr. <abel.passos@gmail.com>

source: You are not in File Explorer to perform OCR on an image file...
fi: Et ole resurssienhallinnassa kuvatiedoston kohdalla.

source: Processing... Please wait... This operation can take some seconds...
fi: Käsitellään, odota... Tämä voi kestää joitakin sekunteja.
